# LockedStartOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LockedStartOffset Property
ParameterTypeId Class See Also
---
"Negative Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LockedStartOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LockedStartOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LockedStartOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace